#include "Example_12.h"
#include "Report_16.h"
#include "Report_17.h"

/*
※ String 사용 금지

과제 1. 주민번호 생성기

- 시작하면 원하는 생년을 입력받는다. (4자리, 2자리 처리)
 ㄴ EX : 1975 / 75

- 월과 일을 입력 (2자리, 1자리 처리)
 ㄴ EX : 06 / 6


- 예외처리 : 31일이 있는 달과 30일까지만 있는 달, 그리고 2월도 예외처리 한다.

- 성별 선택 (남자는 1 또는 3 / 여자는 2 또는 4)
 ㄴ 만약 다른 값을 입력하면 성별을 랜덤으로 결정

- 마지막 6자리는 랜덤으로 출력
 ㄴ 예외처리 : 단, 0이 나오면 안된다.



과제 2. 문자열 과제 (손코딩) - 수요일에 타임어택

- 문자를 입력 받아 입력받은 문자를 거꾸로 출력한다.
 ㄴ EX : ABCD -> DCBA

- 있는 그대로 출력하지만 짝수에 있는 문자만 거꾸로 출력한다.
 ㄴ EX : ASDFG -> AFDSG

- 주민번호를 입력하고 -이 제거된 주민번호로 출력한다.
 ㄴ EX : 1234567 - 12345678 -> 123456712345678


한줄 조사. 사용자 정의 자료형

- 노트에 적어온다.

- 비유할것 생각해 온다.

*/

void main()
{
	//EXAMPLE_2::Example();

	// 과제
	//REPORT_16::Run();
	REPORT_17::Run();
}